Sirtxm/GAP_LoRa_Pump/stm32_LoRa_Wio_E5/LoRaWAN/App/lora_app.c
/* USER CODE END EF */

void LoRaWAN_Init(void)
{
  /* USER CODE BEGIN LoRaWAN_Init_LV */
  uint32_t feature_version = 0UL;
  /* USER CODE END LoRaWAN_Init_LV */

  /* USER CODE BEGIN LoRaWAN_Init_1 */

  /* Get LoRaWAN APP version*/
  APP_LOG(TS_OFF, VLEVEL_M, "APPLICATION_VERSION: V%X.%X.%X\r\n",
          (uint8_t)(APP_VERSION_MAIN),
          (uint8_t)(APP_VERSION_SUB1),
          (uint8_t)(APP_VERSION_SUB2));

  /* Get MW LoRaWAN info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_LORAWAN_VERSION:  V%X.%X.%X\r\n",
          (uint8_t)(LORAWAN_VERSION_MAIN),
          (uint8_t)(LORAWAN_VERSION_SUB1),
          (uint8_t)(LORAWAN_VERSION_SUB2));

  /* Get MW SubGhz_Phy info */
  APP_LOG(TS_OFF, VLEVEL_M, "MW_RADIO_VERSION:    V%X.%X.%X\r\n",
          (uint8_t)(SUBGHZ_PHY_VERSION_MAIN),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB1),
          (uint8_t)(SUBGHZ_PHY_VERSION_SUB2));

  /* Get LoRaWAN Link Layer info */
  LmHandlerGetVersion(LORAMAC_HANDLER_L2_VERSION, &feature_version);
  APP_LOG(TS_OFF, VLEVEL_M, "L2_SPEC_VERSION:     V%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8));

  /* Get LoRaWAN Regional Parameters info */
  LmHandlerGetVersion(LORAMAC_HANDLER_REGION_VERSION, &feature_version);
  APP_LOG(TS_OFF, VLEVEL_M, "RP_SPEC_VERSION:     V%X-%X.%X.%X\r\n",
          (uint8_t)(feature_version >> 24),
          (uint8_t)(feature_version >> 16),
          (uint8_t)(feature_version >> 8),
          (uint8_t)(feature_version));

  UTIL_TIMER_Create(&TxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnTxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&RxLedTimer, LED_PERIOD_TIME, UTIL_TIMER_ONESHOT, OnRxTimerLedEvent, NULL);
  UTIL_TIMER_Create(&JoinLedTimer, LED_PERIOD_TIME, UTIL_TIMER_PERIODIC, OnJoinTimerLedEvent, NULL);

  /* USER CODE END LoRaWAN_Init_1 */

  UTIL_TIMER_Create(&StopJoinTimer, JOIN_TIME, UTIL_TIMER_ONESHOT, OnStopJoinTimerEvent, NULL);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LmHandlerProcess), UTIL_SEQ_RFU, LmHandlerProcess);

  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), UTIL_SEQ_RFU, SendTxData);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStoreContextEvent), UTIL_SEQ_RFU, StoreContext);
  UTIL_SEQ_RegTask((1 << CFG_SEQ_Task_LoRaStopJoinEvent), UTIL_SEQ_RFU, StopJoin);

  /* Init Info table used by LmHandler*/
  LoraInfo_Init();

  /* Init the Lora Stack*/
  LmHandlerInit(&LmHandlerCallbacks, APP_VERSION);

  LmHandlerConfigure(&LmHandlerParams);

  /* USER CODE BEGIN LoRaWAN_Init_2 */
  UTIL_TIMER_Start(&JoinLedTimer);
  UTIL_TIMER_Create(&CurrentSensorTimer, 5000, UTIL_TIMER_ONESHOT, CurrentSensorCallback, NULL);
  UTIL_TIMER_Start(&CurrentSensorTimer);
  /* USER CODE END LoRaWAN_Init_2 */

  LmHandlerJoin(ActivationType, ForceRejoin);

  if (EventType == TX_ON_TIMER)
  {
    /* send every time timer elapses */
    UTIL_TIMER_Create(&TxTimer, TxPeriodicity, UTIL_TIMER_ONESHOT, OnTxTimerEvent, NULL);
    UTIL_TIMER_Start(&TxTimer);
  }
  else
  {
    /* USER CODE BEGIN LoRaWAN_Init_3 */

    /* USER CODE END LoRaWAN_Init_3 */
  }

  /* USER CODE BEGIN LoRaWAN_Init_Last */

  /* USER CODE END LoRaWAN_Init_Last */
}

/* USER CODE BEGIN PB_Callbacks */

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  switch (GPIO_Pin)
  {
    case  BUT1_Pin:
    	// XXX: always initialized
      if (EventType == TX_ON_EVENT || 1)
      {
        UTIL_SEQ_SetTask((1 << CFG_SEQ_Task_LoRaSendOnTxTimerOrButtonEvent), CFG_SEQ_Prio_0);
      }
      break;
    default:
      break;
  }
}

static void CurrentSensorCallback(void *context)
{

	 GPIO_PinState pinState = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_9);
//	 APP_LOG(TS_ON, VLEVEL_L, "Pin state: %d\r\n", pinState);

	if(pinState == GPIO_PIN_SET){
//		 APP_LOG(TS_ON, VLEVEL_L, "Current detected! Sending pump ON uplink...\r\n");
		 AppData.Port = LORAWAN_USER_APP_PORT;
		 AppData.BufferSize = 1;
		 AppDataBuffer[0] = 0x01; // Pump ON
		 AppData.Buffer = AppDataBuffer;
	}
	else if(pinState == GPIO_PIN_RESET)
	{
//		 APP_LOG(TS_ON, VLEVEL_L, "No current! Sending pump OFF uplink...\r\n");
		 AppData.Port = LORAWAN_USER_APP_PORT;
		 AppData.BufferSize = 1;
		 AppDataBuffer[0] = 0x00; // Pump OFF
		 AppData.Buffer = AppDataBuffer;
	}
	SendTxData();
    UTIL_TIMER_Start(&CurrentSensorTimer);
}

/* USER CODE END PB_Callbacks */

/* Private functions ---------------------------------------------------------*/
/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

static void OnRxData(LmHandlerAppData_t *appData, LmHandlerRxParams_t *params)
{
  /* USER CODE BEGIN OnRxData_1 */
  if (params != NULL && appData != NULL && appData->Buffer != NULL && appData->BufferSize >= 1)
  {
    uint8_t command = appData->Buffer[0];

    switch (command)
    {
      case 0x01:  // Pump ON
        if (pumpState != STATE_PUMP_ON)
        {
          APP_LOG(TS_ON, VLEVEL_M, "Command 0x01: Pump ON\r\n");
          pumpState = STATE_PUMP_ON;
          PumpStateMachine(pumpState, 0);
        }
        else
        {
          APP_LOG(TS_ON, VLEVEL_M, "Duplicate command: Pump already ON\r\n");
        }
        break;

      case 0x02:  // Pump AUTO
        if (appData->BufferSize >= 2)
        {
          uint8_t duration = appData->Buffer[1];

            durationMinutes = duration;
            APP_LOG(TS_ON, VLEVEL_M, "Command 0x02: Pump AUTO\r\n");
            APP_LOG(TS_ON, VLEVEL_M, "Duration: %d minute(s)\r\n", durationMinutes);
            pumpState = STATE_AUTO;
            PumpStateMachine(pumpState, durationMinutes);

        }
        else
        {
          APP_LOG(TS_ON, VLEVEL_M, "Command 0x02 requires 2 bytes. Received only %d byte(s)\r\n", appData->BufferSize);
        }
        break;

      case 0x03:  // Pump OFF
        if (pumpState != STATE_PUMP_OFF)
        {
          APP_LOG(TS_ON, VLEVEL_M, "Command 0x03: Pump OFF\r\n");
          pumpState = STATE_PUMP_OFF;
          PumpStateMachine(pumpState, 0);
        }
        else
        {
          APP_LOG(TS_ON, VLEVEL_M, "Duplicate command: Pump already OFF\r\n");
        }
        break;


      default:
        APP_LOG(TS_ON, VLEVEL_M, "Unknown command: 0x%02X\r\n", command);
        break;
    }
  }
  else
  {
    APP_LOG(TS_ON, VLEVEL_M, "Invalid payload received (null or size 0)\r\n");
  }
  /* USER CODE END OnRxData_1 */
}


static void SendTxData(void)
{
  /* USER CODE BEGIN SendTxData_1 */
	 LmHandlerErrorStatus_t status;

	  if (AppData.BufferSize == 0 || AppData.Buffer == NULL)
	  {
	    APP_LOG(TS_ON, VLEVEL_L, "No data to send!\r\n");
	    return;
	  }

	  status = LmHandlerSend(&AppData, LmHandlerParams.IsTxConfirmed, false);

	  if (status == LORAMAC_HANDLER_SUCCESS)
	  {
	    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST SUCCESS\r\n");
	  }
	  else
	  {
	    APP_LOG(TS_ON, VLEVEL_L, "SEND REQUEST FAILED\r\n");
	  }
  /* USER CODE END SendTxData_1 */
}

static void OnTxTimerEvent(void *context)
{
  /* USER CODE BEGIN OnTxTimerEvent_1 */

